/*Запросити у користувача рік народження.
Запитати в нього, в якому місті він живе.
Запитати його улюблений вид спорту.
При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
Його вік.
Якщо користувач запровадить Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицю якої він запровадив. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач запровадить один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати…” і підставляємо на місце точок ім'я та прізвище чемпіона.

Все це має бути відображено в одному вікні (алерті).

Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення - "Шкода, що Ви не захотіли ввести свій(ю) ..." і вказуємо, що він не захотів вводити - дату народження, місто або вид спорту.*/



let date = +prompt('Напишіть рік вашого народження','');
let city = prompt('В якому городі ви мешкаєте?','');
let sport = prompt('Назвіть ваш улюблений вид спорту','');

let age = 2023 - date;

if (date == '') {
    ageConsol = 'Шкода, що ви не захотіли ввести свій рік народження.';
} else {
    ageConsol = `Тобі ${age} років.`;
}

switch (city) {
    case 'Київ':
        cityConsol = `Ти живеш у столиці України.`;
        break;
    case 'Вашингтон':
        cityConsol = `Ти живеш у столиці США.`;
        break;
    case 'Лондон':
        cityConsol = `Ти живеш у столиці Англії.`;
        break;
    case null:
        cityConsol = `Шкода, що ви не захотіли ввести своє місто.`;
        break;
    default:
        cityConsol = `Ти живеш у місті ${city}.`;
}

switch (sport) {
    case 'футбол':
        sportConsol = `Круто! Хочеш стати як Ліонель Мессі?`;
        break;
    case 'бокс':
        sportConsol = `Круто! Хочеш стати як Майк Тайсон?`;
        break;
    case 'бейсбол':
        sportConsol = `Круто! Хочеш стати як Babe Ruth?`;
        break;
    case null:
        sportConsol = `Шкода, що ви не захотіли ввести свій улюблений вид спорту.`;
        break;
    default:
        sportConsol = `Ти полюбляєшь ${sport}.`;
}

alert (`${ageConsol} \n${cityConsol} \n${sportConsol}`);